import * as c from "./commands"

export const commandsRegExp = [
	{
		r: /^(х[еэ]лп|помо(щь|ги)|команды|help|comm?ands?)[.!]?$/,
		f: c.Help
	},
	{
		r: /^(пинг|ping)[.!]?$/,
		f: c.Ping
	},
	{
		r: /^(пикча|имг|картинк?а|изображение|галерея|img|image|pic(ture)?|gallery)[.!,:]?$/,
		f: c.Img
	},
	{
		r: /^(т[еэ]ги|tags)[.!]?$/,
		f: c.Tags
	},
	{
		r: /^(отправ(ит)?ь|предложи(ть)?|пришли|прислать|send)$/,
		f: c.Send
	},
	{
		r: /^([пpрr]|поставь|отреагируй|реакция|react(ion)?)$/,
		f: c.React
	},
	{
		r: /^(э(мо(д[жз]|ж)и)?|смайл(ики|ы)|emoji(s|list)?)[.!]?$/,
		f: c.EmojiList
	},
	{
		r: /^(с(тикер)?|sticker|э(мо(д[жз]|ж)и)?линк|e(moji)?link)$/,
		f: c.Sticker
	},
	{
		r: /^(сервер[аы]|servers)[.!]?$/,
		f: c.Servers
	},
	{
		r: /^(ав(атар(ка)?|к?а)|ava(tar)?|pfp)[.!]?$/,
		f: c.Avatar
	},
	{
		r: /^(приглашение|инвайт|invite)[.!]?$/,
		f: c.Invite
	},
	{
		r: /^(ап(тайм)?|up(time)?)[.!]?$/,
		f: c.Uptime
	},
	{
		r: /^(hs|хс|хоумстак|homestuck)[.!]?$/,
		f: c.Homestuck
	},
	/*
	{
		r: /^(кинопинг|cinemaping)[.!]?$/,
		f: c.CinemaPing
	},
	*/
	{
		r: /^(sftime)[.!]?$/,
		f: c.SnowflakeTime
	},
	{
		r: /^(stats|статы|статистика)[.!]?$/,
		f: c.Stats
	},
	{
		r: /^(когда)[.!]?$/,
		f: c.When
	},
	{
		r: /^(железнаядверь|жд)[.!]?$/,
		f: c.IronDoor
	},
	{
		r: /^(\d)[.!]?$/,
		f: c.Three
	}
]
export const simpleAnswers = [
	{
		r: /^(прив(ет(ствую)?)?|здравствуй(те)?|х[ао]й|хауди)[.!]?$/,
		t: ["Привет.", "Hello, world!", "Доброго времени суток!"],
		e: null
	},
	{
		r: /^(пока|до свидания|прощай(те)?|до скорого)[.!]?$/,
		t: ["Пока!", "До скорой встречи!", "До свидания!"],
		e: null
	},
	{
		r: /^((доброй|спокойной) ночи|(добрых|спокойных|хороших|сладких) снов)[.!]?/,
		t: null,
		e: "🌃"
	},
	{
		r: /^(как дела|что (ты )?делаешь)[?]?/,
		t: ["Отвечаю на твоё сообщение.", "Какие дела могут быть у скрипта?"],
		e: null
	},
	{
		r: /^((что ты|ты что) такое|(кто ты|ты кто)( такой)?)[?]?/,
		t: ["Я – просто скрипт."],
		e: null
	}
]
