export const hiragana = {
    title: "Хирагана",
    syl: [
        "あいうえお",
        "かきくけこ", "がぎぐげご",
        "さしすせそ", "ざじずぜぞ",
        "たちつてと", "だぢづでど",
        "なにぬねの",
        "はひふへほ", "ばびぶべぼ", "ぱぴぷぺぽ",
        "まみむめも",
        "らりるれろ",
        "やゆよわをん"
    ]
}
export const katakana = {
    title: "Катакана",
    syl: [
        "アイウエオ",
        "カキクケコ", "ガギグゲゴ",
        "サシスセソ", "ザジズゼゾ",
        "タチツテト", "ダヂヅデド",
        "ナ二ヌネノ",
        "ハ匕フヘホ", "バビブべボ", "パピプぺポ",
        "マミムメモ",
        "ラリルレロ",
        "ヤユヨワヲン"
    ]
}
export const kanalat = [
    [ "a",  "i",  "u",  "e",  "o"], // 0
    ["ka", "ki", "ku", "ke", "ko"], ["ga", "gi", "gu", "ge", "go"], // 1, 2
    ["sa","shi", "su", "se", "so"], ["za", "ji", "zu", "ze", "zo"], // 3, 4
    ["ta","chi","tsu", "te", "to"], ["da", "ji", "zu", "de", "do"], // 5, 6
    ["na", "ni", "nu", "ne", "no"], // 7
    ["ha", "hi", "fu", "he", "ho"], ["ba", "bi", "bu", "be", "bo"], ["pa", "pi", "pu", "pe", "po"], // 8, 9, 10
    ["ma", "mi", "mu", "me", "mo"], // 11
    ["ra", "ri", "ru", "re", "ro"], // 12
    ["ya", "yu", "yo", "wa", "wo", "n"] // 13
]
export const kanji = [
    {
        s: "口",
        r: ["くち", "こう", "く"],
        m: /рот/
    },
    {
        s: "水",
        r: ["みず", "すい"],
        m: /вода/
    },
    {
        s: "木",
        r: ["き", "ぼく", "もく"],
        m: /дерево/
    },
    {
        s: "人",
        r: ["ひと", "じん", "にん"],
        m: /человек/
    },
    {
        s: "手",
        r: ["て", "しゅ", "ず"],
        m: /рука/
    },
    {
        s: "心",
        r: ["こころ", "しん"],
        m: /сердце/
    },


    {
        s: "言",
        r: ["こと"],
        m: /слово/
    },
    {
        s: "日",
        r: ["ひ", "にち"],
        m: /(солнце|день)/
    },
    {
        s: "糸",
        r: ["いと"],
        m: /нит(ь|ка)|шелк/
    },
    {
        s: "肉",
        r: ["にく"],
        m: /(мясо|орган)/
    },
    {
        s: "月",
        r: ["つき"],
        m: /луна/
    },
    {
        s: "土",
        r: ["つち"],
        m: /земля/
    },
    {
        s: "貝",
        r: ["かい"],
        m: /скорлупа/
    },
    {
        s: "女",
        r: ["おんな", "じょ"],
        m: /(женщина|девочка)/
    },
    {
        s: "金",
        r: ["かね", "きん"],
        m: /(золото|метал|деньги)/
    },


    {
        s: "一",
        r: ["いち"],
        m: /(1|один|раз)/
    },
    {
        s: "刀",
        r: ["かたな"],
        m: /меч/
    },
    {
        s: "十",
        r: ["じゅう"],
        m: /(10|десять)/
    },
    {
        s: "田",
        r: ["た"],
        m: /(рисовое )?поле/
    },
    {
        s: "火",
        r: ["ひ", "か"],
        m: /огонь/
    },
    {
        s: "大",
        r: ["おお", "だい"],
        m: /(большой|огромный)/
    },
    {
        s: "山",
        r: ["やま", "さん"],
        m: /гора/
    },
    {
        s: "食",
        r: ["しょく"],
        m: /(есть|еда)/
    },
    {
        s: "車",
        r: ["くるま"],
        m: /(машина|авто(мобиль)?|транспорт)/
    },
    {
        s: "目",
        r: ["め"],
        m: /глаз/
    },
    {
        s: "雨",
        r: ["あめ"],
        m: /дождь/
    },
    {
        s: "犬",
        r: ["いぬ"],
        m: /(собака|пес)/
    },
    {
        s: "王",
        r: ["おう"],
        m: /король/
    },
    {
        s: "玉",
        r: ["たま"],
        m: /драгоценность/
    },
    {
        s: "石",
        r: ["いし"],
        m: /камень/
    },
    {
        s: "力",
        r: ["ちから"],
        m: /(власть|сила)/
    },
    {
        s: "衣",
        r: ["ころも"],
        m: /одежда/
    },
    {
        s: "弓",
        r: ["ゆみ"],
        m: /лук/
    },
    {
        s: "竹",
        r: ["たけ"],
        m: /бамбук/
    },
    {
        s: "又",
        r: ["また"],
        m: /снова/
    },




    {
        s: "年",
        r: ["とし", "ねん"],
        m: /год/
    },
    {
        s: "国",
        r: ["くに", "こく"],
        m: /страна/
    },
    {
        s: "本",
        r: ["もと", "ほん"],
        m: /(книга|происхождение|источник)/
    },
    {
        s: "中",
        r: ["なか", "うち", "あたる", "ちゅう"],
        m: /(внутри|посередине|середина|центр)/
    },
    {
        s: "出",
        r: ["でる", "だす", "いでる", "いだす", "しゅう", "すい"],
        m: /(выйти|выход)/
    },
    {
        s: "三",
        r: ["み", "みつ", "みっつ", "さん", "ぞう"],
        m: /(3|три)/
    }
]