export const hiragana = {
    title: "Хирагана",
    syl: [
        "あいうえお",
        "かきくけこ", "がぎぐげご",
        "さしすせそ", "ざじずぜぞ",
        "たちつてと", "だぢづでど",
        "なにぬねの",
        "はひふへほ", "ばびぶべぼ", "ぱぴぷぺぽ",
        "まみむめも",
        "らりるれろ",
        "やゆよわをん"
    ]
}
export const katakana = {
    title: "Катакана",
    syl: [
        "アイウエオ",
        "カキクケコ", "ガギグゲゴ",
        "サシスセソ", "ザジズゼゾ",
        "タチツテト", "ダヂヅデド",
        "ナ二ヌネノ",
        "ハ匕フヘホ", "バビブべボ", "パピプぺポ",
        "マミムメモ",
        "ラリルレロ",
        "ヤユヨワヲン"
    ]
}
export const kanalat = [
    [ "a",  "i",  "u",  "e",  "o"], // 0
    ["ka", "ki", "ku", "ke", "ko"], ["ga", "gi", "gu", "ge", "go"], // 1, 2
    ["sa","shi", "su", "se", "so"], ["za", "ji", "zu", "ze", "zo"], // 3, 4
    ["ta","chi","tsu", "te", "to"], ["da", "ji", "zu", "de", "do"], // 5, 6
    ["na", "ni", "nu", "ne", "no"], // 7
    ["ha", "hi", "fu", "he", "ho"], ["ba", "bi", "bu", "be", "bo"], ["pa", "pi", "pu", "pe", "po"], // 8, 9, 10
    ["ma", "mi", "mu", "me", "mo"], // 11
    ["ra", "ri", "ru", "re", "ro"], // 12
    ["ya", "yu", "yo", "wa", "wo", "n"] // 13
]
export const kanji = [
    {
        s: "口",
        r: ["くち", "こう", "く"],
        m: ["mouth"]
    },
    {
        s: "水",
        r: ["みず", "すい"],
        m: ["water"]
    },
    {
        s: "木",
        r: ["き", "ぼく", "もく"],
        m: ["tree"]
    },
    {
        s: "人",
        r: ["ひと", "じん", "にん"],
        m: ["person", "human", "man"]
    },
    {
        s: "手",
        r: ["て", "しゅ", "ず"],
        m: ["hand"]
    },
    {
        s: "心",
        r: ["こころ", "しん"],
        m: ["heart"]
    },


    {
        s: "言",
        r: ["こと", "いう", "げん", "ごん"],
        m: ["word"]
    },
    {
        s: "日",
        r: ["ひ", "にち", "じつ"],
        m: ["sun", "day"]
    },
    {
        s: "糸",
        r: ["いと", "し"],
        m: ["silk", "thread"]
    },
    {
        s: "肉",
        r: ["しし", "にく"],
        m: ["meat"]
    },
    {
        s: "月",
        r: ["つき", "げつ", "がつ"],
        m: ["moon", "month"]
    },
    {
        s: "土",
        r: ["つち", "ど", "と"],
        m: ["earth", "ground"]
    },
    {
        s: "貝",
        r: ["かい", "ばい"],
        m: ["shell"]
    },
    {
        s: "女",
        r: ["おんな", "め", "じょ", "にょ", "にょう"],
        m: ["woman", "girl", "female"]
    },
    {
        s: "金",
        r: ["かね", "かな", "きん", "こん", "ごん"],
        m: ["gold", "metal", "money"]
    },


    {
        s: "一",
        r: ["ひと", "ひとつ", "いち", "いつ"],
        m: ["1", "one"]
    },
    {
        s: "刀",
        r: ["かたな", "そり", "とう"],
        m: ["sword", "knife", "katana"]
    },
    {
        s: "十",
        r: ["とお", "と", "じゅう"],
        m: ["10", "ten"]
    },
    {
        s: "田",
        r: ["た", "でん"],
        m: ["rice field"]
    },
    {
        s: "火",
        r: ["ひ", "か"],
        m: ["fire"]
    },
    {
        s: "大",
        r: ["おお", "おおきい", "おおいに", "だい", "たい"],
        m: ["big", "large"]
    },
    {
        s: "山",
        r: ["やま", "さん", "せん"],
        m: ["mountain"]
    },
    {
        s: "食",
        r: ["くう", "くらう", "たべる", "はむ", "しょく", "じき"],
        m: ["eat", "food"]
    },
    {
        s: "車",
        r: ["くるま", "しゃ"],
        m: ["vehicle", "car"]
    },
    {
        s: "目",
        r: ["め", "もく", "ぼく"],
        m: ["eye"]
    },
    {
        s: "雨",
        r: ["あめ", "う"],
        m: ["rain"]
    },
    {
        s: "犬",
        r: ["いぬ", "けん"],
        m: ["dog"]
    },
    {
        s: "王",
        r: ["おう"],
        m: ["king"]
    },
    {
        s: "玉",
        r: ["たま", "きょく"],
        m: ["ball", "jade", "jewel"]
    },
    {
        s: "石",
        r: ["いし", "せき", "しゃく", "こく"],
        m: ["stone"]
    },
    {
        s: "力",
        r: ["ちから", "りょく", "りき", "りい"],
        m: ["power"]
    },
    {
        s: "衣",
        r: ["ころも", "きぬ", "い", "え"],
        m: ["clothes"]
    },
    {
        s: "弓",
        r: ["ゆみ", "きゅう"],
        m: ["bow"]
    },
    {
        s: "竹",
        r: ["たけ", "ちく"],
        m: ["bamboo"]
    },
    {
        s: "又",
        r: ["また", "ゆう"],
        m: ["again", "furthermore", "on the other hand"]
    },




    {
        s: "年",
        r: ["とし", "ねん"],
        m: ["year"]
    },
    {
        s: "国",
        r: ["くに", "こく"],
        m: ["country"]
    },
    {
        s: "本",
        r: ["もと", "ほん"],
        m: ["book", "origin"]
    },
    {
        s: "中",
        r: ["なか", "うち", "あたる", "ちゅう"],
        m: ["in", "inside", "middle", "mean", "center"]
    },
    {
        s: "出",
        r: ["でる", "だす", "いでる", "いだす", "しゅう", "すい"],
        m: ["exit", "leave", "go out", "come out"]
    },
    {
        s: "三",
        r: ["み", "みつ", "みっつ", "さん", "ぞう"],
        m: ["3", "three"]
    }
]