export const hiragana = {
    title: "Хирагана",
    pic: "https://cdn.discordapp.com/attachments/602935027306856449/647825956878417920/hiragana.png",
    syl: [
        "あいうえお",
        "かきくけこ", "がぎぐげご",
        "さしすせそ", "ざじずぜぞ",
        "たちつてと", "だぢづでど",
        "なにぬねの",
        "はひふへほ", "ばびぶべぼ", "ぱぴぷぺぽ",
        "まみむめも",
        "やゆよ",
        "らりるれろ",
        "わを",
        "ん"
    ]
}
export const katakana = {
    title: "Катакана",
    pic: "https://cdn.discordapp.com/attachments/602935027306856449/647825987190521869/katakana.png",
    syl: [
        "アイウエオ",
        "カキクケコ", "ガギグゲゴ",
        "サシスセソ", "ザジズゼゾ",
        "タチツテト", "ダヂヅデド",
        "ナ二ヌネノ",
        "ハ匕フヘホ", "バビブべボ", "パピプぺポ",
        "マミムメモ",
        "ヤユヨ",
        "ラリルレロ",
        "ワヲ",
        "ン"
    ]
}
export const kanacyr = [
    [ "а",  "и",  "у",  "э",  "о"],
    ["ка", "ки", "ку", "кэ", "ко"], ["га", "ги", "гу", "гэ", "го"],
    ["са", "си", "су", "сэ", "со"], ["за", "зи", "зу", "зэ", "зо"],
    ["та", "ти", "цу", "тэ", "то"], ["да", "ди", "ду", "дэ", "до"],
    ["на", "ни", "ну", "нэ", "но"],
    ["ха", "хи", "фу", "хэ", "хо"], ["ба", "би", "бу", "бэ", "бо"], ["па", "пи", "пу", "пэ", "по"],
    ["ма", "ми", "му", "мэ", "мо"],
    [ "я",        "ю",        "ё"],
    ["ра", "ри", "ру", "рэ", "ро"],
    ["ва",                   "во"],
    [ "н"]
]