export const hiragana = {
    title: "Хирагана",
    syl: [
        "あいうえお",
        "かきくけこ", "がぎぐげご",
        "さしすせそ", "ざじずぜぞ",
        "たちつてと", "だぢづでど",
        "なにぬねの",
        "はひふへほ", "ばびぶべぼ", "ぱぴぷぺぽ",
        "まみむめも",
        "やゆよ",
        "らりるれろ",
        "わを",
        "ん"
    ]
}
export const katakana = {
    title: "Катакана",
    syl: [
        "アイウエオ",
        "カキクケコ", "ガギグゲゴ",
        "サシスセソ", "ザジズゼゾ",
        "タチツテト", "ダヂヅデド",
        "ナ二ヌネノ",
        "ハ匕フヘホ", "バビブべボ", "パピプぺポ",
        "マミムメモ",
        "ヤユヨ",
        "ラリルレロ",
        "ワヲ",
        "ン"
    ]
}
export const kanalat = [
    [ "a",  "i",  "u",  "e",  "o"],
    ["ka", "ki", "ku", "ke", "ko"], ["ga", "gi", "gu", "ge", "go"],
    ["sa","shi", "su", "se", "so"], ["za", "zi", "zu", "ze", "zo"],
    ["ta","chi","tsu", "te", "to"], ["da", "di", "du", "de", "do"],
    ["na", "ni", "nu", "ne", "no"],
    ["ha", "hi", "fu", "he", "ho"], ["ba", "bi", "bu", "be", "bo"], ["pa", "pi", "pu", "pe", "po"],
    ["ma", "mi", "mu", "me", "mo"],
    ["ya",       "yu",       "yo"],
    ["ra", "ri", "ru", "re", "ro"],
    ["wa",                   "wo"],
    [ "n"]
]